library(microbenchmark)

test_text <- '🤡 Роскомнадзор получил ПОЛНОЕ управление над рунетом

Правительство приняло постановление, по которому теперь РКН официально решает, что считать «угрозой» для сети, и может по своему усмотрению перенастраивать маршруты трафика, резать внешние каналы связи и фактически замыкать рунет внутри страны.

Операторы связи будут обязаны выполнять распоряжения службы уже 1 марта 2026 года.

Чебурнет: начало.'

test_llm_stance_sequential <- function() {
    stance(
        text = test_text,
        target = 'Роскомнадзор',
        type = 'object',
        lang = 'ru',
        chat_base = chat_base
    )
}

test_llm_stance_parallel <- function() {
    llm_stance(
        text = test_text,
        target = 'Роскомнадзор',
        type = 'object',
        lang = 'ru',
        chat_base = chat_base,
        rpm = 19
    )
}

bm <- microbenchmark(
    sequential = test_llm_stance_sequential(),
    parallel = test_llm_stance_parallel(),
    times = 5L,
    check = FALSE
)
